Revit 2022 API
IndependentTag.TaggedLocalElementId Property
 The ID of the tagged local element, if any. If the tag is tagged on a subelement of local element, it returns the element ID.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2022 and will be removed in a later version of Revit. We suggest you use the `GetTaggedLocalElementIds()` method instead.")]
public ElementId TaggedLocalElementId { get; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2022 and will be removed in a later version of Revit. We suggest you use the `GetTaggedLocalElementIds()` method instead.")> _
Public ReadOnly Property TaggedLocalElementId As ElementId
	Get
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2022 and will be removed in a later version of Revit. We suggest you use the `GetTaggedLocalElementIds()` method instead.")]
public:
property ElementId^ TaggedLocalElementId {
	ElementId^ get ();
}
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace